{
  "src_word2id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "6": 2,
    "319": 3,
    "322": 4,
    "247": 5,
    "\\N": 6,
    "317": 7,
    "54": 8,
    "238": 9,
    "60": 10,
    "297": 11,
    "242": 12,
    "73": 13,
    "248": 14,
    "5": 15,
    "47": 16,
    "88": 17,
    "289": 18,
    "318": 19,
    "326": 20,
    "25": 21,
    "21": 22,
    "291": 23,
    "246": 24,
    "296": 25,
    "329": 26,
    "36": 27,
    "252": 28,
    "183": 29,
    "40": 30,
    "253": 31,
    "259": 32,
    "202": 33,
    "26": 34,
    "233": 35,
    "321": 36,
    "203": 37,
    "27": 38,
    "288": 39,
    "320": 40,
    "24": 41,
    "200": 42,
    "207": 43,
    "232": 44,
    "231": 45,
    "205": 46,
    "147": 47,
    "161": 48,
    "250": 49,
    "215": 50,
    "293": 51,
    "28": 52,
    "34": 53,
    "292": 54,
    "86": 55,
    "82": 56,
    "217": 57,
    "216": 58,
    "29": 59,
    "74": 60,
    "300": 61,
    "148": 62,
    "277": 63,
    "13": 64,
    "109": 65,
    "261": 66,
    "2": 67,
    "230": 68,
    "35": 69,
    "133": 70,
    "255": 71,
    "107": 72,
    "333": 73,
    "154": 74,
    "57": 75,
    "8": 76,
    "89": 77,
    "81": 78,
    "328": 79,
    "45": 80,
    "295": 81,
    "87": 82,
    "302": 83,
    "220": 84,
    "176": 85,
    "221": 86,
    "84": 87,
    "167": 88,
    "138": 89,
    "236": 90,
    "256": 91,
    "254": 92,
    "323": 93,
    "58": 94,
    "106": 95,
    "219": 96,
    "149": 97,
    "98": 98,
    "134": 99,
    "290": 100,
    "1": 101,
    "258": 102,
    "209": 103,
    "23": 104,
    "165": 105,
    "104": 106,
    "116": 107,
    "245": 108,
    "222": 109,
    "179": 110,
    "305": 111,
    "260": 112,
    "251": 113,
    "108": 114,
    "135": 115,
    "168": 116,
    "3": 117,
    "262": 118,
    "334": 119,
    "113": 120,
    "137": 121,
    "192": 122,
    "99": 123,
    "188": 124,
    "85": 125,
    "173": 126,
    "241": 127,
    "298": 128,
    "182": 129,
    "171": 130,
    "72": 131,
    "158": 132,
    "240": 133,
    "271": 134,
    "327": 135,
    "157": 136,
    "201": 137,
    "12": 138,
    "155": 139,
    "164": 140,
    "204": 141,
    "18": 142,
    "146": 143,
    "46": 144,
    "61": 145,
    "64": 146,
    "249": 147,
    "286": 148,
    "234": 149,
    "227": 150,
    "126": 151,
    "235": 152,
    "31": 153,
    "111": 154,
    "301": 155,
    "162": 156,
    "53": 157,
    "257": 158,
    "172": 159,
    "19": 160,
    "330": 161,
    "226": 162,
    "174": 163,
    "4": 164,
    "237": 165,
    "124": 166,
    "55": 167,
    "175": 168,
    "186": 169,
    "312": 170,
    "315": 171,
    "75": 172,
    "229": 173,
    "141": 174,
    "316": 175,
    "299": 176,
    "263": 177,
    "218": 178,
    "32": 179,
    "129": 180,
    "100": 181,
    "136": 182,
    "294": 183,
    "303": 184,
    "120": 185,
    "125": 186,
    "307": 187,
    "163": 188,
    "206": 189,
    "335": 190,
    "119": 191,
    "66": 192,
    "304": 193,
    "130": 194,
    "214": 195,
    "20": 196,
    "281": 197,
    "159": 198,
    "11": 199,
    "112": 200,
    "65": 201,
    "9": 202,
    "30": 203,
    "170": 204,
    "311": 205,
    "144": 206,
    "331": 207,
    "22": 208,
    "310": 209,
    "63": 210,
    "270": 211,
    "123": 212,
    "195": 213,
    "306": 214,
    "151": 215,
    "187": 216,
    "62": 217,
    "177": 218,
    "308": 219,
    "16": 220,
    "105": 221,
    "228": 222,
    "44": 223,
    "156": 224,
    "90": 225,
    "139": 226,
    "210": 227,
    "185": 228,
    "118": 229,
    "314": 230,
    "225": 231,
    "128": 232,
    "332": 233,
    "166": 234,
    "223": 235,
    "239": 236,
    "39": 237,
    "275": 238,
    "127": 239,
    "211": 240,
    "178": 241,
    "115": 242,
    "121": 243,
    "313": 244,
    "48": 245,
    "324": 246,
    "208": 247,
    "110": 248,
    "224": 249,
    "278": 250,
    "67": 251,
    "309": 252,
    "17": 253,
    "196": 254,
    "51": 255,
    "279": 256,
    "76": 257,
    "50": 258,
    "103": 259,
    "265": 260,
    "145": 261,
    "69": 262,
    "122": 263,
    "284": 264,
    "38": 265,
    "132": 266,
    "272": 267,
    "140": 268,
    "33": 269,
    "190": 270,
    "197": 271,
    "267": 272,
    "15": 273,
    "49": 274,
    "93": 275,
    "10": 276,
    "280": 277,
    "285": 278,
    "264": 279,
    "14": 280,
    "56": 281,
    "169": 282,
    "150": 283,
    "97": 284,
    "276": 285,
    "184": 286,
    "131": 287,
    "79": 288,
    "213": 289,
    "117": 290,
    "244": 291,
    "160": 292,
    "194": 293,
    "273": 294,
    "41": 295,
    "102": 296,
    "71": 297,
    "37": 298,
    "92": 299,
    "181": 300,
    "70": 301,
    "243": 302,
    "114": 303,
    "180": 304,
    "101": 305,
    "143": 306,
    "287": 307,
    "191": 308,
    "52": 309,
    "193": 310,
    "96": 311,
    "78": 312,
    "269": 313,
    "274": 314,
    "68": 315,
    "142": 316,
    "212": 317,
    "283": 318
  },
  "labels": {
    "4": 899979,
    "1": 899915,
    "17": 899909,
    "5": 899995,
    "6": 899987,
    "16": 899925,
    "19": 899957,
    "18": 899966,
    "7": 899949,
    "15": 899971,
    "13": 899999,
    "3": 899998,
    "12": 899994,
    "10": 899985,
    "14": 899997,
    "9": 899991,
    "2": 899981,
    "8": 899812,
    "0": 899791,
    "11": 899843
  }
}